<template>
  <article class="page" :class="{'show': isReady}">
    <top-head :isHide="false" :back="true"></top-head>
    <main class="g-main join-detail">
      <div class="m-article g-container" v-if="curJoinData">
        <h4>{{curJoinData.title}}</h4>
        <section class="article-blk">
          <h5>岗位职责</h5>
          <p v-for="item in curJoinData.duty">{{item}}</p>

        </section>
        <section class="article-blk">
          <h5>任职资格</h5>
          <p v-for="item in curJoinData.require">{{item}}</p>
        </section>
        <section class="article-blk">
          <h5>联系方式</h5>
          <p v-for="item in contact">{{item}}</p>
        </section>
      </div>
    </main>
    <footer class="g-footer">
      <div class="copyright">
        <p>www.yupaopao.cn 2014-2017©All Rights Reserved.</p>
        <p>上海鱼泡泡信息科技有限公司 版权所有</p>
      </div>
    </footer>
  </article>
</template>

<script>
import topHead from '@/components/top-head'

export default {
  name: 'join-detail',
  components: {
    topHead
  },
  data () {
    return {
      isReady: true,
      contact: [
        '简历发送至shengmaoshu@yupaopao.cn',
        '邮件主题请标明：应聘岗位+姓名'
      ],
      joinData: [
        {
          id: '11',
          title: '高级java开发',
          duty: [
            '1. 能独立梳理业务及沟通，并开发实现关键架构代码;',
            '2. 负责服务器端架构设计开发，模块划分，团队合作开发;',
            '3. 主导制定和指导执行服务器端开发流程标准，对服务器端开发质量负责;',
            '4. 对于技术难题负责组织攻关，及相关代码开发',
            '5. 完成领导分配及制定的任务'
          ],
          require: [
            '1. 熟悉持续交付开发流程 ,熟悉JAVA相关分布式中间件原理及底层，精通业务拆分设计；',
            '2. 熟悉thrift、dubbo、eureka框架及相关RPC通信原理，有实战经验，在服务治理，服务监控方面有相关开发经验；',
            '3. 精通java语言，在高并发，高性能方面有相关开发经验，3年以上的J2EE开发工作经验、2年以上的系统架构设计经验，精设计模式深并实战使用，具有扎实的Java编程功底和良好的编码规范；',
            '4. 熟悉微服务设计，精通spring cloud相关套件底层及使用，熟练使用storm、zookeeper、rabbitMQ、kafka、redis、mongodb、mysql、TBSchedule、elastic-job、drds等技术产品.',
            '5. 对分布式系统开发、分布式数据源及分库分表的业务拆分架构、分布式事务开发经验优先；'
          ]
        },
        {
          id: '12',
          title: '高级Andriod开发',
          duty: [
            '1. 根据公司要求进行基于Android系统平台的应用程序开发；',
            '2. 根据项目任务计划按时完成软件编码和单元测试工作；',
            '3. 参与相关软件质量管理活动，确保设计、实现、测试工作按时保质完成；',
            '4. 负责搭建APP稳定性相关数据统计系统，以及负责APP稳定性相关的优化；',
            '5. 负责APP底层网络连接相关的优化;',
            '6. 负责项目的功能拆解和任务分配及移动开发团队的技术培训和工作管理；',
            '7. 对移动和互联网技术有强烈兴趣，富于钻研和探索精神；',
            '8. 较强的逻辑思维能力和沟通能力。'
          ],
          require: [
            '1. 本科及以上学历，计算机相关专业，三年以上 android件开发经验，有较强的阅读代码的能力；',
            '2. 熟悉Java语言，android SDK和NDK。熟悉Android平台体系结构，了解各版本 Android SDK之间的差异；',
            '3. 熟练掌握Android界面和交互开发，并能够熟练使用调试工具，熟悉HTTP协议及Server端相关技术；',
            '4. 具备良好的沟通能力，学习能力，责任心强，能接受较大的工作强度；',
            '5. 有多个完整的安卓项目经验，至少参加过一个完整的社交或娱乐类应用的技术框架搭建、关键技术选型工作。'
          ]
        },
        {
          id: '13',
          title: '高级IOS开发',
          duty: [
            '1. 负责鱼泡泡新产品的iOS客户端软件的开发和维护',
            '2. 根据业务变化，不断改善升级产品，保证系统的性能、稳定性及可靠性以及用户体验'
          ],
          require: [
            '1. 熟练掌握Objective C，3年以上iOS应用开发经验，具备组件设计能力',
            '2. 熟悉算法思想，有较强的解决问题的能力，具有良好的编程习惯',
            '3. 熟悉iOS系统运行原理，熟练掌握核心框架',
            '4. 具有良好的创业精神！！较强的自学能力，能自主解决问题',
            '5. 具备良好的沟通能力和团队合作精神',
            '6. 开发过千万下载量的应用者优先',
            '7. 具备交易类及音频类上线APP开发经验'
          ]
        },
        {
          id: '21',
          title: '运营经理（线下游戏）',
          duty: [
            '1. 根据运营目标，制定各类线上、线下活动方案和节奏，负责活动执行，监控、验收、并提出改良建议；',
            '2. 根据运营目标，通过搭建活动和用户体系，优化补贴策略，优化核心流程转化和产品体验等方式，提高用户活跃和留存；',
            '3. 掌控运营实施情况，通过多种运营渠道采集和分析产品数据、用户数据，进行数据挖掘，对用户需求进行有效分析，并提出改良建议并推进实施。'
          ],
          require: [
            '1. 具有3年SNS社区或互联网运营经验；',
            '2. 对电竞游戏社群有深入的了解，有相关资源优先；',
            '3. 逻辑清晰，擅长数据分析，有丰富运营经验、大型优秀案例背景优先；',
            '4. 主动了解市场变化、收集竞品情报，提出相应市场策略及产品优化建议；',
            '5. 良好的沟通、协调、推动他人的能力。'
          ]
        },
        {
          id: '22',
          title: '运营专员（线下游戏）',
          duty: [
            '1. 负责APP端线下游神招募项目及日常挖掘新用户的规划、流程梳理和运营，根据网站运营策略制定内容；',
            '2. 跟踪、分析游神服务过程，了解用户体验的不足之处，并针对制定改善方案；',
            '3. 参与线下大神运营体系的搭建。'
          ],
          require: [
            '1. 本科及以上学历，1年以上互联网相关职位从业经验，了解互联网行业动态，具备互联网运营思维和策略，优秀毕业生也可考虑；',
            '2. 对互联网市场具有敏感洞察力和良好的商业理念，善于分析归纳数据，并基于数据做出判断与业务调整；',
            '3. 主动性强，善沟通，具备较强的原则性；',
            '4. 会打游戏、热爱电子竞技、泛娱乐等交易娱乐平台有一定了解；'
          ]
        },
        {
          id: '23',
          title: '运营专员（线上游戏）',
          duty: [
            '1. 根据运营目标，制定线上活动方案和节奏，负责活动执行，监控、验收、并提出改良建议；',
            '2. 根据运营目标，通过搭建活动和用户体系，优化补贴策略，优化核心流程转化和产品体验等方式，提高用户活跃和留存；',
            '3. 掌控运营实施情况，通过多种运营渠道采集和分析产品数据、用户数据，进行数据挖掘，对用户需求进行有效分析，并提出改良建议并推进实施。'
          ],
          require: [
            '1. 具有3年SNS社区或游戏运营经验；',
            '2. 对手游、端游社群有深入的了解，有相关资源优先；',
            '3. 逻辑清晰，擅长数据分析，有丰富运营经验、大型优秀案例背景优先；',
            '4. 主动了解市场变化、收集竞品情报，提出相应市场策略及产品优化建议；',
            '5. 良好的沟通、协调、推动他人的能力。'
          ]
        },
        {
          id: '24',
          title: '运营专员（线下娱乐）',
          duty: [
            '1. 根据运营目标，制定线下K歌、线下休闲娱乐活动方案和节奏，负责活动执行，监控、验收、并提出改良建议；',
            '2. 通过搭建活动和用户体系，优化补贴策略，优化核心流程转化和产品体验等方式，提高用户活跃和留存；',
            '3. 掌控运营实施情况，通过多种运营渠道采集和分析产品数据、用户数据，进行数据挖掘，对用户需求进行有效分析，并提出改良建议并推进实施。'
          ],
          require: [
            '1. 2年以上移动互联网或O2O运营经验；',
            '2. 对泛娱乐社交兴趣浓厚，有上进心、责任心；',
            '3. 逻辑清晰，擅长数据分析，有丰富运营经验、大型优秀案例背景优先；',
            '4. 主动了解市场变化、收集竞品情报，提出相应市场策略及产品优化建议；',
            '5. 抗压能力强，结果导向思维方式；',
            '6. 有线下休闲娱乐运营经验优先。'
          ]
        },
        {
          id: '25',
          title: '客服专员',
          duty: [
            '1. 接听400客服热线，处理日常APP应用咨询服务。主要包括：APP线上充值疑难问题处理，APP线上活动咨询，活动流程引导，客户退款流程处理等；',
            '2. 处理因线上问题而需要后续对接的工作，包括电话跟进回访工作；',
            '3. 负责线上咨询量的统计。'
          ],
          require: [
            '1. 普通话标准，口齿清楚，思维敏捷；',
            '2. 大专以上学历，专业不限；',
            '3. 中文输入60字/分钟以上；',
            '4. 脾气好，有耐心，有亲和力，有很强的责任心和说服能力；',
            '5. 有服务行业、呼叫中心相关服务经验者优先；',
            '6. 应往届生均可。',
            '7. 会玩网络游戏者，优先考虑。'
          ]
        },
        {
          id: '31',
          title: '产品经理',
          duty: [
            '1. 用户研究：通过用户行为数据分析、竞争产品跟踪，用户调研等方法深入理解用户需求',
            '2. 推荐效果改进：优化鱼泡泡的各种推荐场景的策略升级和形态优化',
            '3. 新产品探索：根据用户偏好和使用场景，探索新的推荐场景和新的推荐形态',
            '4. 项目管理：准确把握项目目标和周期，协调各方资源，保证项目按时完成'
          ],
          require: [
            '1. 热爱泛娱乐社交，有较强的事业心、责任心',
            '2. 1年以上个性化推荐或数据分析师经验',
            '3. 优秀的沟通能力和学习能力，市场洞察能力较强、执行能力强，有创新精神，抗压能力强 ',
            '4. 追求极致的用户体验，注重数据驱动，强烈的结果导向意识',
            '5. 本科及以上学历'
          ]
        },
        {
          id: '32',
          title: '产品专员',
          duty: [
            '1. 参与产品设计、讨论，辅助规划产品核心功能；',
            '2. 配合设计产品业务流程，以及交互体验设计；',
            '3. 根据产品大纲撰写PRD、原型线框图、业务流程图等书面文档；',
            '4. 协助产品经理协调各人员（研发、设计、测试、需求者）正常的工作，及时跟进汇报开发情况；',
            '5. 协助产品经理制作各类报告、文档、处理日常事务。'
          ],
          require: [
            '1. 工作积极主动、责任心强，敢拼敢想敢做，对自己职业生涯有明确的追求；',
            '2. 深度理解团队合作，具有良好的沟通、协作和团队组织能力；',
            '3. 抗压能力强、自我要求高、敢于挑战新任务；',
            '4. 具备良好的理解能力和表达能力，思维紧密、逻辑清晰；',
            '5. 必需对社交、泛娱乐充满兴趣~'
          ]
        },
        {
          id: '33',
          title: '高级UI设计',
          duty: [
            '1. 负责产品前期的视觉用户研究、设计流行趋势分析，主导设定产品的整体风格。',
            '2. 负责公司APP、Web产品的创意和设计，能将产品原型赋予视觉生命力。',
            '3. 负责参与UI设计流程的制定和规范。',
            '4. 配合产品经理和交互设计师进行UI界面优化，提升用户体验。',
            '5. 为日常运营活动及功能维护提供视觉设计支持，并能够形成产品独特的具有传播力的运营设计风格。',
            '6. 分享设计经验，推动提高团队的设计能力。'
          ],
          require: [
            '1. 有强烈好奇心和良好的学习能力，能独立自主研究和解决未知问题的能力，不断拓展自己的上限。',
            '2. 有工匠精神，对自己的产出品质有严格要求。',
            '3. 有3年以上移动互联网设计工作经验，独立负责完成过Web网站UI设计、APP界面设计。',
            '4. 熟悉Web、移动端UI设计流程及设计规范，对UI设计有丰富经验和巨大热情。',
            '5. 对图标，中西文字体，排版，色彩理论有比较深的理解和执行能力。',
            '6. 有很强的系统思考能力，能从不同方面和层级看问题。',
            '7. 对制定设计规范和设计语言系统(DLS)有丰富经验。',
            '8. 精通Photoshop、Illustrator、Sketch等设计软件，有基本的手绘表达能力，能独立从创意构思走到像素级执行。'
          ]
        },
        {
          id: '41',
          title: '活动策划',
          duty: [
            '1. 负责鱼泡泡站内和站外的活动运营策划和执行；',
            '2. 配合新媒体运营，用户运营，内容运营策划相应的站内推广方案；',
            '3. 寻找符合鱼泡泡的目标受众人群的活动论坛，组织目标用户开展活动；',
            '4. 用丰富的活动内容活跃站内用户的粘性。'
          ],
          require: [
            '1. 有互联网1-3年运营经验；',
            '2. 有创意，执行力强，良好的策略思考能力并能独立撰写方案；',
            '3. 性格开朗，有优秀的交际适应能力；',
            '4. 会使用premiere，edius，final cut pro等剪辑软件者优先；',
            '5. 有团队配合意识。'
          ]
        },
        {
          id: '42',
          title: '整合营销传播经理',
          duty: [
            '1. 负责鱼泡泡品牌线上业务的整合营销传播方案的整体创意和策划，独立撰写方案并完成内部提报；',
            '2. 协调内外部的各类资源来推进并完成整合营销campaign；',
            '3. 深入了解鱼泡泡用户的心理，必须长期泡在与鱼泡泡线上运营沟通交流之中；',
            '4. 所策划的整合营销传播方案必须能扩大新用户来量及刺激用户付费。',
            '5. 为最终的效果负责。'
          ],
          require: [
            '1. 对热点信息敏感、把握能力强，能够及时反应；',
            '2. 爱策划，好琢磨，脑洞大，注重逻辑，想法精奇；',
            '3. 审美高，文字强，PPT娴熟，擅表达，能提案；',
            '4. 热爱互联网，责任心强，激情正直，有情怀，富有团队精神；',
            '5. 四年以上广告、公关或整合营销等相关工作经验；'
          ]
        }
      ]
    }
  },
  mounted () {

  },
  computed: {
    curJoinData () {
      var self = this
      return self.joinData.filter(item => self.$route.params.id === item.id)[0]
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>
